{
	"link":"http://community.topcoder.com/stat?c=problem_statement&pm=11114&rd=14541",
	"statement":"You are given a table where each row contains exactly M columns, numbered 0 through M-1. Each value in the table is an integer between 1 and 50, inclusive. Each row of the table is distinct, and the table contains all possible distinct rows. Two rows are considered distinct if there is at least one column where the rows have a different value. Hence, the table contains exactly 50^M rows. <br /><br /><br /><br /> The rows of the table can be sorted using the following scheme: \n <ol> \n  <li>First, for each column, assign a permutation of all the integers between 1 and 50, inclusive. Note that this permutation may differ for each column.</li> \n  <li>Next, pick a permutation of all M columns.</li> \n  <li>Finally, sort the rows in ascending order. Compare each pair of rows as follows: \n   <ol> \n    <li>Consider the first column in the permutation chosen in step 2. Compare the values in both rows in this column.</li> \n    <li>If the values in this column are the same in both rows, check the values in the next column in the permutation instead. Repeat this until the values for the chosen column are different.</li> \n    <li>The row which contains the value that comes earlier in the permutation chosen in step 1 for this column is considered to be smaller than the other row.</li> \n   </ol></li>\n </ol> You are given a String[] <b>rows</b> that contains a description of several rows of the table described above. Each element represents a single row and contains exactly M characters. The i-th character in each element represents the value in column i for that row and is one of the following letters: \n <ul> \n  <li>'a'-'z' corresponds to values 1-26</li> \n  <li>'A'-'X' corresponds to values 27-50</li> \n </ul> For each of the given rows, define P as the 1-based index of that row in a table sorted as described above. For any given ordering, where an ordering is defined by the permutations chosen in steps 1 and 2 above, define S as the sum of all P for the given rows. Find the minimum possible value of S and return it modulo 1,000,000,007.",
	"notes":[
		{
			"order":1,
			"val":"The number that you should minimize is the number before the modulo and not after the modulo. That is, 1,000,000,010 is larger than 20 even though 1,000,000,010 modulo 1,000,000,007 = 3 < 20."
		},
		{
			"order":2,
			"val":"Duplicate elements are allowed in . In case  contains C > 1 occurrences of a certain row, the value of P for this row must be added towards S for C times (see example 4)."
		}
	],
	"definition":[
		{
			"definitionKey":"Class:",
			"definitionVal":"RowsOrdering",
			"order":1
		},
		{
			"definitionKey":"Method:",
			"definitionVal":"order",
			"order":2
		},
		{
			"definitionKey":"Parameters:",
			"definitionVal":"String[]",
			"order":3
		},
		{
			"definitionKey":"Returns:",
			"definitionVal":"int",
			"order":4
		},
		{
			"definitionKey":"Method signature:",
			"definitionVal":"int order(String[] rows)",
			"order":5
		}
	],
	"examples":[
		{
			"expect":"Returns: 54",
			"id":0,
			"input":"{\"bb\", \"cb\", \"ca\"}",
			"note":"One possible ordering is as follows:  For the first column, choose the permutation {c, b, ...}. For the second column, choose the permutation {b, a, ...}. Then, choose the permutation {1, 0} for the columns.  The rows will then be indexed as follows: \"cb\" = 1 \"bb\" = 2 ... \"ca\" = 51 \"ba\" = 52 ...   The sum is 1+2+51 = 54.",
			"order":1
		},
		{
			"expect":"Returns: 127553",
			"id":0,
			"input":"{\"abcd\", \"ABCD\"}",
			"note":"Lowercase and uppercase letters are considered distinct.",
			"order":2
		},
		{
			"expect":"Returns: 943877448",
			"id":0,
			"input":"{\"Example\", \"Problem\"}",
			"note":"",
			"order":3
		},
		{
			"expect":"Returns: 28",
			"id":0,
			"input":"{\"a\", \"b\", \"c\", \"d\", \"e\", \"f\", \"g\"}",
			"note":"",
			"order":4
		},
		{
			"expect":"Returns: 2",
			"id":0,
			"input":"{\"a\", \"a\"}",
			"note":"Duplicate elements are allowed. The value of P for each such element should be added towards S separately.",
			"order":5
		}
	],
	"constraints":[
		{
			"order":1,
			"val":"rows will contain between 1 and 50 elements, inclusive."
		},
		{
			"order":2,
			"val":"Each element of rows will contain between 1 and 50 characters, inclusive."
		},
		{
			"order":3,
			"val":"All the elements of rows will contain the same number of characters."
		},
		{
			"order":4,
			"val":"Each character in rows will be either 'a'-'z' or 'A'-'X'."
		}
	]
}