{
	"link":"http://community.topcoder.com/stat?c=problem_statement&pm=2322&rd=5003",
	"statement":"<i>*** You may only submit a given problem once - no resubmissions will be accepted. ***</i><br /><br /><br /><br />Suppose there is a <i>universal set</i> called <i>U</i> containing the integers between 1 and <b>size</b> inclusive. You will be given some <b>subsets</b> of <i>U</i>. A subset of <i>U</i> is a set of numbers that are in <i>U</i>. The set can contain no numbers (empty set), every number in <i>U</i>, or anything in between. Each subset will be given as a String containing a single space-delimited list of the numbers in the set. The Borel Field <i>B</i> (also called sigma-algebra) generated by <b>subsets</b> is the smallest collection of sets satisfying the following statements: \n <ul> \n  <li> 1) All of the sets in <b>subsets</b> are in <i>B</i>,</li> \n  <li> 2) if <i>X</i> and <i>Y</i> are sets in <i>B</i> then <i>X</i> <i>union</i> <i>Y</i> is in <i>B</i>,</li> \n  <li> 3) if <i>X</i> is a set in <i>B</i> then the <i>complement</i> of <i>X</i> is in <i>B</i>.</li> \n </ul> Given two sets of numbers, the union is the set of all numbers that are in either or both. The complement of a set <i>X</i> contains all numbers that are in <i>U</i> but not in <i>X</i> (if <i>U</i>=<i>X</i> the complement of <i>X</i> is empty). Given <b>subsets</b> you will return how many distinct sets are in the Borel Field it generates. When comparing sets to see if they are distinct, note that duplicate elements within a set are ignored. In other words, a set does not have any duplicates, but a description of the set may. For example, the sets &quot;1 1 2&quot;, &quot;1 2&quot;, and &quot;2 2 1&quot; are indistinguishable as sets, but &quot;1 2 3&quot; is distinct from the previous three.",
	"notes":[],
	"definition":[
		{
			"definitionKey":"Class:",
			"definitionVal":"BorelSets",
			"order":1
		},
		{
			"definitionKey":"Method:",
			"definitionVal":"howMany",
			"order":2
		},
		{
			"definitionKey":"Parameters:",
			"definitionVal":"int, String[]",
			"order":3
		},
		{
			"definitionKey":"Returns:",
			"definitionVal":"int",
			"order":4
		},
		{
			"definitionKey":"Method signature:",
			"definitionVal":"int howMany(int size, String[] subsets)",
			"order":5
		}
	],
	"examples":[
		{
			"expect":"{\"1 2\",\"\"}",
			"id":0,
			"input":"4",
			"note":"We have that  We know \"1 2\", and \"\" are in the resultant Borel Field. By taking the complement of \"1 2\" we get \"3 4\". By taking the complement of \"\" we get \"1 2 3 4\". There are no other sets in the Borel Field.",
			"order":1
		},
		{
			"expect":"{\"\",\"1\",\"2\",\"3\",\"4\",\"5\",\"6\",\"7\",\"8\",\"9\",\"10\"}",
			"id":0,
			"input":"10",
			"order":2
		},
		{
			"expect":"{\"\",\"1 1 2\",\"1 1 2 2 1 1\",\"\",\"2 1 1\"}",
			"id":0,
			"input":"5",
			"order":3
		}
	],
	"constraints":[
		{
			"order":1,
			"val":"size will be between 1 and 10 inclusive."
		},
		{
			"order":2,
			"val":"subsets will contain between 1 and 50 elements inclusive."
		},
		{
			"order":3,
			"val":"Each element of subsets will contain between 0 and 50 characters inclusive."
		},
		{
			"order":4,
			"val":"Each element of subsets will either be an empty string, or a single space-delimited list of integers. Each integer in the list will be between 1 and size inclusive, and will have no leading zeros."
		},
		{
			"order":5,
			"val":"Each element of subsets will not have any leading or trailing spaces."
		}
	]
}