{
	"link":"http://community.topcoder.com/stat?c=problem_statement&pm=152&rd=3025",
	"statement":"<pre>Class name: SecretOffer\nMethod name: translate\nParameters: String\nReturns: long\n\n\nA secretive group wants to make offers through email in a way that will be\ndifficult to distinguish from normal email traffic.  The offer consists of a\nsingle integer value.\n\n\nHere is the method signature (Be sure your method is public):\nlong translate(String message)\n\n\nThe value is described in terms of the names of its digits (zero, one, two,\nthree, four, five, six, seven, eight, nine).  The characters of these names are\nscattered throughout the message in order.  The first digit in the value is the\nfirst digit completed in the message (a digit is completed when all its\ncharacters have occurred in the message in order ignoring case).\n\n\nNo digit may re-use an individual character that is used by another digit.\n\n\nEach digit always considers the first possible character that can be the next\nletter in its name. (ie: &quot;fisivex&quot; translates to 56, never to just 5).\n\n\nIn the case that a single character completes two different digits, the smaller\ndigit takes precedence.  For example, the second 'e' in &quot;thorenee&quot; finishes\nboth &quot;one&quot; and &quot;three&quot;.  Because 1 &lt; 3, the second e is used to finish the\ndigit one.  The third and final e is used to finish the digit &quot;three&quot; and the\nreturn value for &quot;thorenee&quot; is 13.\n\n\nINPUT:\nA string of length between 1 and 50, inclusive, containing letters (a-z, A-Z),\nand/or spaces.\n\nOUTPUT:\nThe sum of the message (as a long).  If no digits are found, return 0.  Ignore\nany leading zeros.\n\n\nEXAMPLES:\n\n\nInput:  &quot;The Final Fantasy movie is now in theaters&quot;\n\n\n1st digit: five Fi(nal Fantasy mo)v(i)e(...)\nleaving &quot;The nal Fantasy moi is now in theaters&quot;\n\n\n2nd digit: one (T...m)o(i is )n(ow in th)e(...)\nleaving &quot;The nal Fantasy mi is ow in thaters&quot;\n\n\n3rd digit: one (T...s )o(w i)n( that)e(...)\nleaving &quot;The nal Fantasy mi is w i thatrs&quot;\n\n\nNo more ordered digits remain in the String, so we have digits 5, 1, 1.i\n\n\nOutput: 511\n\n\nInput:  &quot;Summer has been very dull and lifeless this year&quot;\nOutput: 7\n\n\nInput:  &quot;Nit picking again eh Obiwan Kenobi&quot;\nOutput: 912\n\n\nInput:  &quot;evif&quot;\nOutput: 0\n\n\nInput:  &quot;threfive&quot;\nOutput: 3\n\n\nInput:  &quot;nineight&quot;\nOutput: 9\n\n</pre>",
	"notes":[],
	"definition":[
		{
			"definitionKey":"Class:",
			"definitionVal":"SecretOffer",
			"order":1
		},
		{
			"definitionKey":"Method:",
			"definitionVal":"translate",
			"order":2
		},
		{
			"definitionKey":"Parameters:",
			"definitionVal":"String",
			"order":3
		},
		{
			"definitionKey":"Returns:",
			"definitionVal":"long",
			"order":4
		},
		{
			"definitionKey":"Method signature:",
			"definitionVal":"long translate(String param0)",
			"order":5
		}
	],
	"examples":[],
	"constraints":[]
}