{
	"link":"http://community.topcoder.com/stat?c=problem_statement&pm=95&rd=3010",
	"statement":"<pre>Class name:  Punnet\nMethod name: computeProbability\nParameters:  String, String, String\nReturns:     double\n\nPhenotypes are traits and are determined by genotypes which are represented by\na pair of alleles - one from the mother and one from the father.  Each allele\nis represented by a letter and can be either dominant or recessive where the\ncapital letter indicates the trait is dominant, and the lowercase indicates a\nrecessive trait.  If one or more of the pair of alleles is dominant, then the\nexpressed phenotype is the dominant trait. If two recessive alleles are\npresent, then the recessive trait is the expressed phenotype.\n\nWhen two organisms breed, the offspring organism randomly gets one of the two\nalleles of each of the mother's genotypes and one of the two alleles of each of\nthe father's genotypes.  For each genotype, these two alleles constitute the\npair of alleles of the offspring's genotype, and thus determine which phenotype\nwill be expressed in the offspring.\n\nFor example, assume that peas can be either yellow or green.  The allele for\nthe color of the peas can be either &quot;A&quot; or &quot;a&quot;, with &quot;A&quot; representing the\ndominant trait yellow peas and &quot;a&quot; representing the recessive trait green peas.\nIf an organism's alleles for pea color are one of &quot;AA&quot;, &quot;Aa&quot;, or &quot;aA&quot;, then\nthe peas are yellow, otherwise, they are green (&quot;aa&quot;).  Assume that the mother\nhas green peas (alleles &quot;aa&quot;) and that the father has yellow peas (alleles\n&quot;Aa&quot;).  The Punnet square shows the four offspring possible:\n\nMom\\Dad |    aA   |\n--------+----+----+\n        | aa | aA |\n   aa   +----+----+\n        | aa | aA |\n--------+----+----+\nBecause the child can get the first small a from mom and the small a from dad or\nthe second small a from mom and the small a from dad or\nthe first small a from mom and the big A from dad or\nthe second small a from mom and the big A from dad.\n\nSo there is 2/4=50% chance the offspring will have green peas and a 2/4=50%\nchance the offspring will have yellow peas.\n\nImplement a class Punnet, which contains a method computeProbability.  The\nmethod computes the probability that the offspring from two given parents will\nhave a certain set of phenotypes.  Input parameters will be (String mom, String\ndad, String child) where mom and dad are up to 30 characters long indicating\ntheir respective alleles for up to 15 phenotypes (one for each of the first 15\nletters of the alphabet in alphabetical order), and child is up to 15\ncharacters long indicating the desired trait for each phenotype (one character\nin the string for each phenotype in the parents, in order).  Output will be a\ndouble that holds the theoretical probability that the child will occur during\nany given mating.\n\nThe method signature is:\ndouble computeProbability(String mom,String dad,String child);\n\nTopCoder will check the validity of mom, dad, and child.\n\nNotes:\n-mom and dad are of even length since the alleles come in pairs\n-The first allele pair is for the A/a phenotype, the second for the B/b\nphenotype, and so on.\n-The total probability is the product of the probability of each of the\nconsidered probabilities.\n-If a space occurs in the child, that indicates that we do not care about that\nspecific phenotype, and that its probability should not be considered.\n-If the child is all spaces, we don't care about anything, and the method\nshould return 1.0.\n\nIn the example above, if we wanted green peas, then:\nmom = &quot;aa&quot;\ndad = &quot;aA&quot;\nchild = &quot;a&quot;\nand 0.5 would be returned.\n\nAnother example:\nmom   = &quot;aABBCcDd&quot;\ndad   = &quot;AabbCCDd&quot;\nchild = &quot;A Cd&quot;\nFor A/a:  The child may be AA, aA, Aa, or aa, so there is a 3/4 chance the\nchild will express the dominant A phenotype.\nFor B/b:  We do not care (space)\nFor C/c:  The child may be CC, CC, Cc, or Cc, so there is a 4/4 chance the\nchild will express the dominant C phenotype.\nFor D/d:  The child may be DD, Dd, dD, or dd, so there is a 1/4 chance the\nchild will express the recessive d phenotype.\nTherefore .75*1*.25=0.1875 is returned.\n</pre>",
	"notes":[],
	"definition":[
		{
			"definitionKey":"Class:",
			"definitionVal":"Punnet",
			"order":1
		},
		{
			"definitionKey":"Method:",
			"definitionVal":"computeProbability",
			"order":2
		},
		{
			"definitionKey":"Parameters:",
			"definitionVal":"String, String, String",
			"order":3
		},
		{
			"definitionKey":"Returns:",
			"definitionVal":"double",
			"order":4
		},
		{
			"definitionKey":"Method signature:",
			"definitionVal":"double computeProbability(String param0, String param1, String param2)",
			"order":5
		}
	],
	"examples":[],
	"constraints":[]
}