{
	"link":"http://community.topcoder.com/stat?c=problem_statement&pm=2235&rd=5070",
	"statement":"<p> In a robust computer system, one of the most important pieces is the cooling. Without proper cooling, processors can heat up to over 400 degrees C. The reliability of a system can be measured by determining how many fans can fail without risking the system processor. Each fan can be assigned a value indicating how much capacity it has to cool the system, and we can define a minimum cooling capacity, which the sum of the fan capacities must exceed to properly cool the system. We define a Failure Set as a set of fans which are not necessary to cool the system. In other words, if the fans in a Failure Set break, the system can still be properly cooled by the remaining fans. The count of a Failure Set is the number of fans in the set. </p> <p> To measure the reliability, we will define two values, the <i>Maximum Failure Set</i> (MFS) and the <i>Maximum Failure Count</i> (MFC). A MFS is a Failure Set of fans with the largest count possible. A set of fans may have more than one MFS (see below). A Failure Set is an MFS if and only if there are no Failure Sets with a higher count. The MFC is the largest value such that all fan sets with count &lt;= MFC are Failure Sets. In other words, any set of fans of size MFC or less can fail, and the system will still be properly cooled by the remaining fans. </p> <p> Consider the fan set with capacities 1, 2, 3, and a cooling requirement of 2. Two MFSs with a count of 2 exist: fans 1 and 3, or fans 1 and 2. However, the MFC is not 2 because fans 2 and 3 is not a Failure set (fan 1 could not cool the system properly by itself). Thus, the MFC is 1, because if any single fan fails, the system can still be cooled. </p> <p> You will be given a int[] <b>capacities</b>, which designates how many units of cooling each fan provides, and an int <b>minCooling</b>, which designates the minimum units of cooling required to cool the system. Your method should return a int[], where the first value should be the number of fans in the <i>Maximum Failure Set</i> (MFS), and the second value should be the <i>Maximum Failure Count</i> (MFC). </p>",
	"notes":[],
	"definition":[
		{
			"definitionKey":"Class:",
			"definitionVal":"FanFailure",
			"order":1
		},
		{
			"definitionKey":"Method:",
			"definitionVal":"getRange",
			"order":2
		},
		{
			"definitionKey":"Parameters:",
			"definitionVal":"int[], int",
			"order":3
		},
		{
			"definitionKey":"Returns:",
			"definitionVal":"int[]",
			"order":4
		},
		{
			"definitionKey":"Method signature:",
			"definitionVal":"int[] getRange(int[] capacities, int minCooling)",
			"order":5
		}
	],
	"examples":[
		{
			"expect":"2",
			"id":0,
			"input":"{1,2,3}",
			"note":"Example from the problem statement.",
			"order":1
		},
		{
			"expect":"22",
			"id":0,
			"input":"{8,5,6,7}",
			"note":"No fans can fail in this system.",
			"order":2
		},
		{
			"expect":"1000",
			"id":0,
			"input":"{676, 11, 223, 413, 823, 122, 547, 187, 28}",
			"note":"If you eliminate fans with 676, 11, 413, 122, 547, 187, and 28, you are left with 223 + 823 = 1046 units of cooling, which is sufficient, yielding an MFS size of 7. If you eliminate 676, 823, and 547, you are left with only 984 units of cooling. All combinations of 2 or less fans breaking leaves sufficient cooling, so the MFC is 2.",
			"order":3
		},
		{
			"expect":"3619",
			"id":0,
			"input":"{955, 96, 161, 259, 642, 242, 772, 369, 311, 785, 92, 991, 620, 394, 128, 774, 973, 94, 681, 771, 916, 373, 523, 100, 220, 993, 472, 798, 132, 361, 33, 362, 573, 624, 722, 520, 451, 231, 37, 921, 408, 170, 303, 559, 866, 412, 339, 757, 822, 192}",
			"order":4
		}
	],
	"constraints":[
		{
			"order":1,
			"val":"capacities has between 1 and 50 elements, inclusive."
		},
		{
			"order":2,
			"val":"each element of capacities is between 1 and 1000, inclusive."
		},
		{
			"order":3,
			"val":"minCooling is between 1 and 50000, inclusive."
		},
		{
			"order":4,
			"val":"The sum of all elements in capacities will be greater than or equal to minCooling."
		}
	]
}