{
	"link":"http://community.topcoder.com/stat?c=problem_statement&pm=11987&rd=15095",
	"statement":"There is a two-dimensional infinite plane. Toastman painted <b>N</b> of the grid points in the plane black. These grid points are numbered 0 through <b>N</b>-1. The coordinates of point i are (x[i],y[i]). They are chosen in such a way that no two points share the same x-coordinate and no two points share the same y-coordinate. <br /><br /> <br /><br /> Toastwoman wants to color three of these <b>N</b> points: some point r will be red, some point g green, and some point b blue. She thinks a coloring is beautiful if x[r] &lt; x[g] &lt; x[b] and at the same time y[r] &lt; y[b] &lt; y[g]. (Note that the order of colors for the y-coordinate is <i>not</i> the same as the order for the x-coordinate.) <br /><br /> <br /><br /> In order to have a large set of points, we will generate one using a pseudorandom generator. You will be given the int <b>N</b> specifying the number of points, and eight ints: <b>xzero</b>, <b>xmul</b>, <b>xadd</b>, <b>xmod</b>, <b>yzero</b>, <b>ymul</b>, <b>yadd</b>, and <b>ymod</b>. Generate the coordinates of the points in the following way: \n <ul> \n  <li>x[0] = <b>xzero</b></li> \n  <li>For each i between 1 and <b>N</b>-1, inclusive, x[i] = (x[i-1] * <b>xmul</b> + <b>xadd</b>) % <b>xmod</b></li> \n  <li>y[0] = <b>yzero</b></li> \n  <li>For each i between 1 and <b>N</b>-1, inclusive, y[i] = (y[i-1] * <b>ymul</b> + <b>yadd</b>) % <b>ymod</b></li> \n </ul> Return the number of beautiful colorings for the set of points generated using the above procedure.",
	"notes":[{
		"order":1,
		"val":"There is a solution that does not use any properties of the pseudorandom generator. This solution would solve any set of  points within the time limit."
	}],
	"definition":[
		{
			"definitionKey":"Class:",
			"definitionVal":"ThreePoints",
			"order":1
		},
		{
			"definitionKey":"Method:",
			"definitionVal":"countColoring",
			"order":2
		},
		{
			"definitionKey":"Parameters:",
			"definitionVal":"int, int, int, int, int, int, int, int, int",
			"order":3
		},
		{
			"definitionKey":"Returns:",
			"definitionVal":"long",
			"order":4
		},
		{
			"definitionKey":"Method signature:",
			"definitionVal":"long countColoring(int N, int xzero, int xmul, int xadd, int xmod, int yzero, int ymul, int yadd, int ymod)",
			"order":5
		}
	],
	"examples":[
		{
			"expect":"3",
			"id":0,
			"input":"9",
			"note":"There are 9 points. The coordinates of points are (3, 5), (8, 10), (4, 1), (5, 4), (2, 3), (0, 7), (6, 2), (10, 0), and (9, 8). There are 8 beautiful coloring.   ",
			"order":1
		},
		{
			"expect":"9",
			"id":0,
			"input":"4",
			"order":2
		},
		{
			"expect":"30",
			"id":0,
			"input":"20",
			"order":3
		},
		{
			"expect":"99097861",
			"id":0,
			"input":"300000",
			"order":4
		}
	],
	"constraints":[
		{
			"order":1,
			"val":"N will be between 3 and 300,000, inclusive."
		},
		{
			"order":2,
			"val":"xmod and ymod will be between N and 1,000,000,000, inclusive."
		},
		{
			"order":3,
			"val":"xzero, xmul and xadd will be between 0 and xmod - 1, inclusive."
		},
		{
			"order":4,
			"val":"yzero, ymul and yadd will be between 0 and ymod - 1, inclusive."
		},
		{
			"order":5,
			"val":"No two points will have the same x-coordinate."
		},
		{
			"order":6,
			"val":"No two points will have the same y-coordinate."
		}
	]
}