{
	"link":"http://community.topcoder.com/stat?c=problem_statement&pm=2371&rd=4745",
	"statement":"<p> There is a famous puzzle in which you try to determine which of twelve coins is counterfeit. You know that the counterfeit coin is slightly heavier or lighter than the eleven good coins, and your only tool is a balance scale that can tell which of two stacks of coins is heavier, or if they are the same weight. In the famous puzzle, you must discover which coin is counterfeit and whether it is heavier or lighter than the good coins, using no more than three weighings. </p> <p> In this problem, you are given <b>N</b> coins. As in the puzzle, exactly one of the coins is counterfeit, and it is slightly heavier or lighter than the other coins, which are all the same weight. Using a balance scale, you want to determine which coin is counterfeit <i>and</i> whether it is heavier or lighter than the good coins, using the minimum number of weighings. It is possible that your weighing strategy will use different numbers of weighings in different cases. You want to minimize the maximum number of weighings required by your strategy. For example, a strategy that always takes four weighings is preferable to a strategy that usually takes three weighings but occasionally takes five weighings. </p> <p> You have already made several weighings, and now you need to determine which coins to weigh next. The individual coins are labeled with uppercase letters beginning with 'A'. For example, if <b>N</b> is 5, then the coins are labeled 'A', 'B', 'C', 'D', and 'E'. You will be given two String[]'s, <b>left</b> and <b>right</b>, where element <i>k</i> of <b>left</b> identifies which coins were on the left side of the scale during weighing <i>k</i>, and element <i>k</i> of <b>right</b> identifies which coins were on the right side of the scale during weighing <i>k</i>. (Note that the weighings are numbered from 0.) You will also be given a String <b>result</b>, where character <i>k</i> of <b>result</b> describes the result of weighing <i>k</i>. The character 'L' means that the left stack was heavier, the character 'R' means that the right stack was heavier, and the character 'E' means that the two stacks were the same weight. For example, in the following scenario, </p> <pre>\n   N      = 12\n   left   = { &quot;ABCD&quot;, &quot;ABC&quot; }\n   right  = { &quot;EFGH&quot;, &quot;IJK&quot; }\n   result = { &quot;EL&quot; }\n</pre> coins A, B, C, and D were compared to E, F, G, and H in weighing 0, and the two stacks were the same weight. In weighing 1, coins A, B, and C were compared to I, J, and K, and the left stack (A, B, and C) was heavier. <p> Your task is to decide which coins to weigh next. You want to choose the coins that minimize the maximum number of weighings needed from this point forward, assuming all subsequent weighings (if any) will be chosen optimally. For example, suppose you are trying to decide between two arrangements for the next weighing. Arrangement 1 will require one subsequent weighing regardless of the result of the current weighing. Arrangement 2 will require no subsequent weighings if the result of the current weighing is 'L' or 'R', but will require two subsequent weighings if the result of the current weighing is 'E'. Then you would choose arrangement 1. </p> <p> You will return the coins as a String of the form &quot;&lt;<i>left</i>&gt;-&lt;<i>right</i>&gt;&quot; where &lt;<i>left</i>&gt; is the coins in the left stack and &lt;<i>right</i>&gt; is the coins in the right stack. The coins in each stack should always be listed in alphabetical order. For example, if you wanted to compare the coins A and B to the coins C and D, you would return &quot;AB-CD&quot;. If two different configurations of coins achieve the same maximum number of weighings, prefer the one that uses the fewest coins. For example &quot;AB-CD&quot; would be preferred over &quot;ABC-DEF&quot;. If there is still a tie, prefer the configuration that comes first alphabetically. </p> <p> If the previous weighings are sufficient to determine which coin is counterfeit <i>and</i> whether it is heavier or lighter than the good coins, return the empty string (&quot;&quot;). If the results of the previous weighings are mutually inconsistent or otherwise incompatible with the hypothesis that exactly one of the coins is counterfeit, return &quot;error&quot;. </p>",
	"notes":[],
	"definition":[
		{
			"definitionKey":"Class:",
			"definitionVal":"CounterfeitCoin",
			"order":1
		},
		{
			"definitionKey":"Method:",
			"definitionVal":"nextWeighing",
			"order":2
		},
		{
			"definitionKey":"Parameters:",
			"definitionVal":"int, String[], String[], String",
			"order":3
		},
		{
			"definitionKey":"Returns:",
			"definitionVal":"String",
			"order":4
		},
		{
			"definitionKey":"Method signature:",
			"definitionVal":"String nextWeighing(int N, String[] left, String[] right, String result)",
			"order":5
		}
	],
	"examples":[
		{
			"expect":"{}",
			"id":0,
			"input":"12",
			"note":"In the famous problem, the first weighing should weigh the first four coins against the next four coins.",
			"order":1
		},
		{
			"expect":"{ \"ABCD\", \"ABC\" }",
			"id":0,
			"input":"12",
			"note":"The example above. ",
			"order":2
		},
		{
			"expect":"{ \"ABCD\", \"ABC\", \"I\" }",
			"id":0,
			"input":"12",
			"note":"I is the counterfeit coin, and it is light.",
			"order":3
		},
		{
			"expect":"{ \"AB\", \"EF\" }",
			"id":0,
			"input":"6",
			"note":"The coins appear to all be the same weight. Or perhaps several of the coins are counterfeit. Either way, it's an error.",
			"order":4
		},
		{
			"expect":"{ \"ACE\" }",
			"id":0,
			"input":"7",
			"note":"The first weighing rules out coins A-F, so the counterfeit coin must be G. However, we do not yet know if it is heavy or light, so we need one more weighing to determine that.",
			"order":5
		},
		{
			"expect":"{ \"ACDJMNOQ\", \"CD\", \"G\", \"ABC\", \"R\"}",
			"id":0,
			"input":"20",
			"order":6
		},
		{
			"expect":"{}",
			"id":0,
			"input":"26",
			"order":7
		}
	],
	"constraints":[
		{
			"order":1,
			"val":"N is between 3 and 26, inclusive."
		},
		{
			"order":2,
			"val":"left contains between 0 and 5 elements, inclusive."
		},
		{
			"order":3,
			"val":"right contains the same number of elements as left."
		},
		{
			"order":4,
			"val":"result contains the same number of characters as elements in left."
		},
		{
			"order":5,
			"val":"Each element of left contains between 1 and 13 characters, inclusive."
		},
		{
			"order":6,
			"val":"Element k of left contains the same number of characters as element k of right."
		},
		{
			"order":7,
			"val":"Every character in left and right is between 'A' and the N-th uppercase letter, inclusive."
		},
		{
			"order":8,
			"val":"The characters in each element of left and right occur in alphabetical order, with no repeats."
		},
		{
			"order":9,
			"val":"Element k of left shares no characters in common with element k of right."
		},
		{
			"order":10,
			"val":"result contains only the characters 'L', 'R', and 'E'."
		}
	]
}