{
	"link":"http://community.topcoder.com/stat?c=problem_statement&pm=13504&rd=16080",
	"statement":"<p>Cat Snuke and wolf Sothe are playing the Greater Game. The game is played with cards. Each card has a number written on it. There are 2N cards. The numbers on the cards are the integers between 1 and 2N, inclusive.</p> <br /><br /> <p>At the beginning of the game, each player gets N of the cards and chooses the order in which he wants to play them. The game then consists of N turns. In each turn, both players play one of their cards simultaneously. The player who revealed the card with the larger number gets a point.</p> <br /><br /> <p>You are given a int[] <b>hand</b>. The elements of <b>hand</b> are the numbers on Snuke's cards. He can play those cards in any order he chooses.</p> <br /><br /> <p>Obviously, Snuke can determine the numbers on Sothe's cards, but he does not necessarily know the order in which Sothe is going to play his cards. You are given the information Snuke has about Sothe in a int[] <b>sothe</b>. For each i, element i of <b>sothe</b> is either the number on the card Sothe will play in turn i (0-based index), or -1 if Snuke does not know the card Sothe will play in that turn.</p> <br /><br /> <p>Snuke wants to play according to a strategy that maximizes the expected number of points he'll get. Find that strategy and return the corresponding expected number of Snuke's points at the end of the game.</p> <br /><br /> <p>As shown in Example 0, the optimal strategy for Snuke may involve some random decisions. However, note that before the game starts Snuke must choose the order in which he is going to play all his cards. He is not allowed to change their order after he sees some of the cards played by Sothe.</p>",
	"notes":[],
	"definition":[
		{
			"definitionKey":"Class:",
			"definitionVal":"GreaterGame",
			"order":1
		},
		{
			"definitionKey":"Method:",
			"definitionVal":"calc",
			"order":2
		},
		{
			"definitionKey":"Parameters:",
			"definitionVal":"int[], int[]",
			"order":3
		},
		{
			"definitionKey":"Returns:",
			"definitionVal":"double",
			"order":4
		},
		{
			"definitionKey":"Method signature:",
			"definitionVal":"double calc(int[] hand, int[] sothe)",
			"order":5
		}
	],
	"examples":[
		{
			"expect":"{-1,-1}",
			"id":0,
			"input":"{4,2}",
			"note":"Sothe will play the cards 1 and 3 in some unknown order. The best strategy for Snuke is to flip a coin and to play his cards either in the order {2,4} or in the order {4,2} with equal probability. This leads to two equally likely results of the game:  Therefore, the expected number of Snuke's points is 1.5.",
			"order":1
		},
		{
			"expect":"{1,3}",
			"id":0,
			"input":"{4,2}",
			"note":"If Snuke plays card 2 first and card 4 next, he is guaranteed to score 2 points.",
			"order":2
		},
		{
			"expect":"{-1}",
			"id":0,
			"input":"{2}",
			"note":"Sothe's only card has to be 1, and thus Snuke is guaranteed to win the only turn of this game.",
			"order":3
		},
		{
			"expect":"{8,-1,4,-1}",
			"id":0,
			"input":"{1,3,5,7}",
			"note":"",
			"order":4
		},
		{
			"expect":"{-1,-1,4,-1,11,3,13,-1,-1,18}",
			"id":0,
			"input":"{6,12,17,14,20,8,16,7,2,15}",
			"note":"",
			"order":5
		}
	],
	"constraints":[
		{
			"order":1,
			"val":"N will be between 1 and 50, inclusive."
		},
		{
			"order":2,
			"val":"hand and sothe will contain exactly N elements each."
		},
		{
			"order":3,
			"val":"Each element of hand will be an integer between 1 and 2N, inclusive."
		},
		{
			"order":4,
			"val":"Each element of sothe will be either -1, or an integer between 1 and 2N, inclusive."
		},
		{
			"order":5,
			"val":"The positive integers in hand and sothe will be distinct."
		}
	]
}