{
	"link":"http://community.topcoder.com/stat?c=problem_statement&pm=1754&rd=4625",
	"statement":"Our system has thousands of users, each with a unique User Id. When a new user needs an id, we want to assign his User Id based on his first, middle, and last name. <p> We do not want to assign a User Id if the names were incorrectly entered. If the names are unreasonable we will return &quot;BAD DATA&quot;. A name is judged to be unreasonable if it contains a character other than a letter ('a'-'z' or 'A'-'Z'), an apostrophe ''', or a space character ' '. It is also unreasonable if the first or last name contains less than 2 letters ('a'-'z' or 'A'-'Z'). </p><p> The algorithm for choosing a User Id is to choose the first rule below that produces a User Id that has not already been assigned to another user. In each case, truncate the last name as needed so that the resulting User Id is no longer than 8 characters. </p>\n <ul>\n  <li> [first initial][last name] </li> \n  <li> [first initial][middle initial][last name] </li> \n  <li> [first initial][last name][digit][digit] </li>\n </ul> <p></p><p> Before we form the User Id, we will simply eliminate all apostrophes and space characters, and will change all uppercase letters to lowercase. If there is no middle name (or if the middle name contains no letters) then we must skip the second rule. When we apply the third rule, we will try the digit pairs in order starting with 01 then 02 etc. until we find a previously unused User Id. </p><p> Create a class UserId that contains method id that takes a String[] <b>inUse</b> containing all the User Id's that have already been assigned and Strings <b>first</b>, <b>middle</b>, and <b>last</b> as input. It will return &quot;BAD DATA&quot; if the name data is unreasonable, or will return the User Id generated by our algorithm. </p> ",
	"notes":[],
	"definition":[
		{
			"definitionKey":"Class:",
			"definitionVal":"UserId",
			"order":1
		},
		{
			"definitionKey":"Method:",
			"definitionVal":"id",
			"order":2
		},
		{
			"definitionKey":"Parameters:",
			"definitionVal":"String[], String, String, String",
			"order":3
		},
		{
			"definitionKey":"Returns:",
			"definitionVal":"String",
			"order":4
		},
		{
			"definitionKey":"Method signature:",
			"definitionVal":"String id(String[] inUse, String first, String middle, String last)",
			"order":5
		}
	],
	"examples":[
		{
			"expect":"\"Bob\"",
			"id":0,
			"input":"{\"bjones\",\"bjones03\",\"bmjones\",\"old34id\"}",
			"note":" Rule 1 generates \"bjones\" which is already taken. Rule 2 does not apply when there is no middle name. Rule 3 generates \"bjones01\", which is not already taken. ",
			"order":1
		},
		{
			"expect":" \"Bob Mack\"",
			"id":0,
			"input":"{\"bjones\",\"bjones03\",\"bmjones\",\"old34id\"} ",
			"note":"Rule 1 generates \"bjones\" which is already taken Rule 2 generates \"bhjones\" which is available.",
			"order":2
		},
		{
			"expect":"\"BoB-Mack\"",
			"id":0,
			"input":"{\"bjonesto\",\"bjones01\",\"bjonesto\",\"old34id\"} ",
			"note":"The hyphen in \"BoB-Mack\" is illegal.",
			"order":3
		},
		{
			"expect":"\"'m m\"",
			"id":0,
			"input":"{\"momorris\",\"mmmm\",\"momorr01\"}",
			"note":"The name is just barely reasonable because the first name has just the two letters required, and the middle name is allowed to be empty. Rule 1 generates \"momorris\", which is already in use. Rule 2 cannot be applied since there is no middle name. So rule 3 is applied. ",
			"order":4
		},
		{
			"expect":"\"'m m\"",
			"id":0,
			"input":"{}",
			"note":"The period in the middle name is not allowed.",
			"order":5
		}
	],
	"constraints":[
		{
			"order":1,
			"val":"inUse will contain between 0 and 50 elements inclusive"
		},
		{
			"order":2,
			"val":"each element of inUse will contain between 3 and 8 characters inclusive"
		},
		{
			"order":3,
			"val":"each character in each element of inUse will be a lowercase letter 'a'-'z' or a digit '0'-'9'"
		},
		{
			"order":4,
			"val":"first, middle, and last will each contain between 0 and 50 characters inclusive"
		},
		{
			"order":5,
			"val":"first, middle, and last will contain only ascii characters 32-126 inclusive"
		}
	]
}