{
	"link":"http://community.topcoder.com/stat?c=problem_statement&pm=8186&rd=10786",
	"statement":"There are several empty containers lined up in a row, and you want to put packages into them. You start with the first container and the first package. Do the following until all the packages are inside containers:<br /><br /><br /><br /> \n <ol> \n  <li>If the current package cannot fit into the current container, skip to step 3. Otherwise, go to the next step.</li> \n  <li>Put the current package into the current container. Grab the next package, and go back to step 1.</li> \n  <li>Put the current container aside (you will not put any more packages into that container). Move on to the next container in line, and go back to step 1.</li> \n </ol> You are given a int[] <b>containers</b>, the i-th element of which is the capacity of the i-th container in line, and a int[] <b>packages</b>, the i-th element of which is the size of the i-th package. The constraints will guarantee that you will be able to put all the packages into containers using the above procedure. Return the sum of the wasted space in all the containers. The wasted space in a container is its capacity minus the total size of its contents.",
	"notes":[
		{
			"order":1,
			"val":"A set of packages fits into a container if the total size of all the packages in the set does not exceed the capacity of the container."
		},
		{
			"order":2,
			"val":"You must use the containers and the packages in the order that they are given. You may not reorder them."
		}
	],
	"definition":[
		{
			"definitionKey":"Class:",
			"definitionVal":"Containers",
			"order":1
		},
		{
			"definitionKey":"Method:",
			"definitionVal":"wastedSpace",
			"order":2
		},
		{
			"definitionKey":"Parameters:",
			"definitionVal":"int[], int[]",
			"order":3
		},
		{
			"definitionKey":"Returns:",
			"definitionVal":"int",
			"order":4
		},
		{
			"definitionKey":"Method signature:",
			"definitionVal":"int wastedSpace(int[] containers, int[] packages)",
			"order":5
		}
	],
	"examples":[
		{
			"expect":"{ 5, 5, 5 }",
			"id":0,
			"input":"{ 5, 5, 5 }",
			"note":"Here, we've got 3 packages of size 5 and 3 containers of size 5, so no space will be wasted.",
			"order":1
		},
		{
			"expect":"{ 5, 5, 5 }",
			"id":0,
			"input":"{ 5, 6, 7 }",
			"note":"All the packages are of size 5. We will put the first package into the container of size 5, the second package into the container of size 6 and the third into the container of size 7. The overall wasted space will be equal to (5 - 5) + (6 - 5) + (7 - 5) = 3.",
			"order":2
		},
		{
			"expect":"{ 3 }",
			"id":0,
			"input":"{ 2, 3, 5 }",
			"note":"Here, we've got only one package of size 3. First, we'll try to put it into the container of size 2, but it won't fit, so we'll put it into the second container, leaving the third untouched. The overall wasted space will be 2 + (3 - 3) + 5 = 7.",
			"order":3
		},
		{
			"expect":"{ 3, 3, 3, 3, 3 }",
			"id":0,
			"input":"{ 3, 4, 5, 6 }",
			"note":"",
			"order":4
		}
	],
	"constraints":[
		{
			"order":1,
			"val":"containers will contain between 1 and 50 elements, inclusive."
		},
		{
			"order":2,
			"val":"Each element of containers will be between 1 and 1000, inclusive."
		},
		{
			"order":3,
			"val":"packages will contain between 1 and 50 elements, inclusive."
		},
		{
			"order":4,
			"val":"Each element of packages will be between 1 and 1000, inclusive."
		},
		{
			"order":5,
			"val":"It will be possible to put all the packages inside containers using the method described in the statement."
		}
	]
}