{
	"link":"http://community.topcoder.com/stat?c=problem_statement&pm=11704&rd=14729",
	"statement":"The Very Heterogeneous State of Feudalia's army is designing a new spy robot. The robot is disguised as a turtle and takes four different commands:<br /><br /> \n <ul> \n  <li>&quot;right X&quot;, where X is a integer between 1 and 359, inclusive. Will add X degrees to the turtle's direction angle. </li> \n  <li>&quot;left X&quot;, where X is a integer between 1 and 359, inclusive. Will subtract X degrees from the turtle's direction angle. </li> \n  <li>&quot;forward X&quot;, where X is a integer. Will move X units in the direction given by the turtle's direction angle.</li> \n  <li>&quot;backward X&quot;, where X is a integer. Will move X units in the opposite direction of the turtle's direction angle (The angle minus 180 degrees).</li> \n </ul><br /><br /> The army created a program that made the robot infiltrate deeply into foreign land by making the robot terminate as far as possible from the original location. Unfortunately, Feudalia is world famous for the ineptitude of its public officials. The program got mixed up and there is no way to tell the original order of the commands. You are given a String[] <b>commands</b>. Each element of <b>commands</b> represents a command in the described format. Find the order for all of the commands in the input that will maximize the Euclidean distance between the point where the robot was started and the point it reached after all commands were executed. Return the maximum distance. ",
	"notes":[
		{
			"order":1,
			"val":"The Euclidean distance between the points (x1,y1) and (x2,y2) is sqrt( (x2-x1)^2 + (y2-y1)^2 )."
		},
		{
			"order":2,
			"val":"Your return value must be within 1e-9 relative or absolute error of the correct value"
		}
	],
	"definition":[
		{
			"definitionKey":"Class:",
			"definitionVal":"TurtleSpy",
			"order":1
		},
		{
			"definitionKey":"Method:",
			"definitionVal":"maxDistance",
			"order":2
		},
		{
			"definitionKey":"Parameters:",
			"definitionVal":"String[]",
			"order":3
		},
		{
			"definitionKey":"Returns:",
			"definitionVal":"double",
			"order":4
		},
		{
			"definitionKey":"Method signature:",
			"definitionVal":"double maxDistance(String[] commands)",
			"order":5
		}
	],
	"examples":[
		{
			"expect":"Returns: 141.4213562373095",
			"id":0,
			"input":"{\"forward 100\", \"backward 100\", \"left 90\" }",
			"note":"That distance is possible if we make sure to run the  command inbetween the other two commands.",
			"order":1
		},
		{
			"expect":"Returns: 200.0",
			"id":0,
			"input":"{\"left 45\", \"forward 100\", \"right 45\", \"forward 100\"}",
			"note":"We can, for example, run the commands in the following order: \"forward 100\", \"left 45\", \"right 45\" and \"forward 100\". ",
			"order":2
		},
		{
			"expect":"Returns: 40.58520737741619",
			"id":0,
			"input":"{\"left 10\", \"forward 40\", \"right 30\", \"left 10\", \"backward 4\", \"forward 4\" }",
			"note":"",
			"order":3
		}
	],
	"constraints":[
		{
			"order":1,
			"val":"commands will contain between 1 and 50 elements, inclusive."
		},
		{
			"order":2,
			"val":"Each element of commands will be a string in the form &quot;COMM X&quot;, where COMM is one of &quot;left&quot;, &quot;right&quot;, &quot;forward&quot; or &quot;backward&quot; (quotes for clarity) and X is a integer between 1 and 1000, inclusive."
		},
		{
			"order":3,
			"val":"For each element of commands, if the command is &quot;left&quot; or &quot;right&quot; then X will not exceed 359."
		}
	]
}