{
	"link":"http://community.topcoder.com/stat?c=problem_statement&pm=7641&rd=10731",
	"statement":" <p> Several people want to play hockey, so they use the following algorithm to split themselves into teams. There are <b>teams</b> captains, numbered from 1 to <b>teams</b>, who select players for their respective teams. The draft process is split into several rounds, which are enumerated starting from 1. Captain 1 starts round 1 of the draft by picking a single player, followed by captain 2 and all the other captains in order of ascending indices. When captain teams makes his pick, round 1 is over. If any unpicked players remain, the draft continues with round 2. In round 2, all captains make their picks in reverse order - so captain <b>teams</b> starts the round, and captain 1 ends it. Rounds 3, 5 and all other rounds with odd numbers go similar to round 1, while all rounds with even numbers go similar to round 2. For example, if there are 4 captains, they'll pick players in the following order: 1, 2, 3, 4, 4, 3, 2, 1, 1, 2, 3, ... The draft is over when all players are picked. </p> <p> One of the captains wants to have a team which will use powerplay tactics during its games, while all the other captains want to have regular teams. Powerplay skills are different from the usual skills required for playing hockey. You will be given int[]s <b>usualSkills</b> and <b>powerplaySkills</b>. The i-th elements of <b>usualSkills</b> and <b>powerplaySkills</b> represent the usual and powerplay skills, respectively, of the i-th player. </p> <p> During the draft, a captain of a regular team will always pick the player with the highest usual skill among all remaining players. If several players have the same maximal usual skill, the player with the higher powerplay skill will be picked. The captain of the powerplay team will make his picks in such a way that maximizes the final total powerplay skill in his team. This means he won't necessarily always pick the remaining player with the highest powerplay skill (see examples). You will be given an int <b>ind</b> - the 1-based number of the captain who wants to build the powerplay team. Return the total powerplay skill of the team he chooses. </p>",
	"notes":[],
	"definition":[
		{
			"definitionKey":"Class:",
			"definitionVal":"BuildTheBestTeam",
			"order":1
		},
		{
			"definitionKey":"Method:",
			"definitionVal":"maximalStrength",
			"order":2
		},
		{
			"definitionKey":"Parameters:",
			"definitionVal":"int[], int[], int, int",
			"order":3
		},
		{
			"definitionKey":"Returns:",
			"definitionVal":"int",
			"order":4
		},
		{
			"definitionKey":"Method signature:",
			"definitionVal":"int maximalStrength(int[] usualSkills, int[] powerplaySkills, int teams, int ind)",
			"order":5
		}
	],
	"examples":[
		{
			"expect":"{20, 20, 20, 20, 20, 20}",
			"id":0,
			"input":"{10, 10, 10, 10, 10, 10}",
			"note":"All players have equal skills, so the order of picks doesn't matter here. The powerplay team will get 2 players with powerplay skills of 20, resulting in a total skill of 40.",
			"order":1
		},
		{
			"expect":"{10, 30, 10, 10, 30, 10}",
			"id":0,
			"input":"{10, 10, 10, 10, 10, 10}",
			"note":"The two players with higher powerplay skills will be the first two picks, so team 3 will get only 2 players with powerplay skills of 10.",
			"order":2
		},
		{
			"expect":"{6, 5, 4, 3, 2, 1}",
			"id":0,
			"input":"{1, 2, 3, 4, 5, 6}",
			"note":"The powerplay team can get players with powerplay skills of 6 and 5.",
			"order":3
		},
		{
			"expect":"{6, 2, 4, 3, 5, 1}",
			"id":0,
			"input":"{1, 2, 3, 4, 5, 6}",
			"note":"",
			"order":4
		},
		{
			"expect":"{68, 74, 14, 1}",
			"id":0,
			"input":"{88, 82, 82, 73}",
			"note":"According to the rules the powerplay captain has the first and the last picks, while the other captain has the second and the third. The powerplay captain has the following choices: ",
			"order":5
		}
	],
	"constraints":[
		{
			"order":1,
			"val":"usualSkills will contain between 2 and 50 elements, inclusive."
		},
		{
			"order":2,
			"val":"powerplaySkills and usualSkills will contain the same number of elements."
		},
		{
			"order":3,
			"val":"Each element of usualSkills will be between 1 and 100, inclusive."
		},
		{
			"order":4,
			"val":"Each element of powerplaySkills will be between 1 and 100, inclusive."
		},
		{
			"order":5,
			"val":"teams will be between 2 and 50, inclusive."
		},
		{
			"order":6,
			"val":"The number of elements in usualSkills will be an integer multiple of teams."
		},
		{
			"order":7,
			"val":"ind will be between 1 and teams, inclusive."
		}
	]
}