{
	"link":"http://community.topcoder.com/stat?c=problem_statement&pm=12379&rd=15487",
	"statement":"Manao is developing a simple 2-D computer game. The screen of the game is H pixels high and W pixels wide (1 &lt;= H, W &lt;= 50). <br /><br /><br /><br /> Manao is currently working on the background which should be filled with N mountains (1 &lt;= N &lt;= 10). The mountains are numbered from 0 to N-1. The contents of the screen are stored in an array of characters <tt>pix</tt> where <tt>pix</tt>[x, y] gives the contents of the pixel at column x, row y. Both indices are 0-based. Columns are numbered left to right and rows are numbered bottom to top. The parts of the screen where the i-th mountain is visible are denoted by digit i. Character '.' means that the corresponding pixel is not covered by any mountains. <br /><br /><br /><br /> The i-th (0-based index) mountain is described by its peak position (X[i], Y[i]), 0 &lt;= X[i] &lt; W, 0 &lt;= Y[i] &lt; H. In order to draw the mountains, the following pseudocode is used: <br /><br /><br /><br /> <tt>Fill all elements of pix with '.' characters.</tt><br /><br /> <tt>For 0 </tt>&lt;=<tt> i </tt>&lt;<tt> N:</tt><br /><br /> <tt>&nbsp;&nbsp;For 0 </tt>&lt;=<tt> x </tt>&lt;<tt> W:</tt><br /><br /> <tt>&nbsp;&nbsp;&nbsp;&nbsp;For 0 </tt>&lt;=<tt> y </tt>&lt;=<tt> Y[i] - |x - X[i]|:</tt><br /><br /> <tt>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;pix[x, y] := i + '0'</tt><br /><br /> <br /><br /> For example, consider three mountains with peaks at (1, 1), (2, 2) and (4, 1). Once these mountains are drawn on a screen with H = 3, W = 6, the resulting picture will look as follows: <pre>\n..1...\n.1112.\n111222\n</pre> <br /><br /> Manao has recently filled the background with N mountains as described above. After that he wrote down the height of each mountain. Also, for each column he wrote down which mountains were visible at that column. You are given a int[] <b>heights</b> containing N elements. Element i of <b>heights</b> gives the height of the i-th mountain in pixels (which is equal to Y[i] + 1). You are also given a String[] <b>visibility</b>. It contains N elements and each element is W characters long. The j-th character of <b>visibility</b>[i] is equal to 'X' if the i-th mountain was visible at column j of the screen and '-' otherwise. In other words, the j-th character of <b>visibility</b>[i] is equal 'X' if and only if at least one pixel of column j contained digit i after all mountains were drawn. <br /><br /><br /><br /> Count the number of sequences of exactly N mountains that match the information given by <b>heights</b> and <b>visibility</b>. Return this number modulo 1,000,000,009. It is guaranteed that there exists at least one such sequence.",
	"notes":[{
		"order":1,
		"val":"The value of H is not directly given in the input parameters. For the purposes of this problem, you can assume that H is equal to the largest element of ."
	}],
	"definition":[
		{
			"definitionKey":"Class:",
			"definitionVal":"Mountains",
			"order":1
		},
		{
			"definitionKey":"Method:",
			"definitionVal":"countPlacements",
			"order":2
		},
		{
			"definitionKey":"Parameters:",
			"definitionVal":"int[], String[]",
			"order":3
		},
		{
			"definitionKey":"Returns:",
			"definitionVal":"int",
			"order":4
		},
		{
			"definitionKey":"Method signature:",
			"definitionVal":"int countPlacements(int[] heights, String[] visibility)",
			"order":5
		}
	],
	"examples":[
		{
			"expect":"{\"------\", \"XXXX--\", \"---XXX\"}",
			"id":0,
			"input":"{2, 3, 2}",
			"note":"The given information corresponds to the three mountains from the problem statement. Mountains 1 and 2 are uniquely determined. Mountain 0 can have the peak in each column from 1 to 4.",
			"order":1
		},
		{
			"expect":"{\"XXXXX--------\", \"----------XXX\", \"----XXXXXXX--\"}",
			"id":0,
			"input":"{4, 3, 4}",
			"note":"The four possible mountain sequences are:   After drawing these sequences, the following pictures are obtained:                                                                            ",
			"order":2
		},
		{
			"expect":"{\"XXXXXXXXX\", \"-XXX-----\", \"----XXXXX\", \"-----XXX-\"}",
			"id":0,
			"input":"{13, 2, 3, 2}",
			"note":"",
			"order":3
		},
		{
			"expect":"{\"X------\", \"-------\", \"------X\", \"-------\", \"XXXXXXX\"}",
			"id":0,
			"input":"{8, 2, 9, 3, 10}",
			"note":"",
			"order":4
		},
		{
			"expect":"{\"-------------------\", \"-------------------\", \"-------------------\", \"-------------------\", \"-------------------\", \"-------------------\", \"-------------------\", \"------------XXXXXXX\", \"XXXXXXX------------\", \"XXXXXXXXXXXXXXXXXXX\"} ",
			"id":0,
			"input":"{20, 20, 20, 20, 20, 20, 45, 50, 49, 50}",
			"note":"",
			"order":5
		}
	],
	"constraints":[
		{
			"order":1,
			"val":"heights will contain between 1 and 10 elements, inclusive."
		},
		{
			"order":2,
			"val":"Each element of heights will be between 1 and 50, inclusive."
		},
		{
			"order":3,
			"val":"visibility will contain the same number of elements as heights."
		},
		{
			"order":4,
			"val":"Each element of visibility will be between 1 and 50 characters long, inclusive."
		},
		{
			"order":5,
			"val":"All elements of visibility will be of the same length."
		},
		{
			"order":6,
			"val":"Each element of visibility will consist of 'X' and '-' characters only."
		},
		{
			"order":7,
			"val":"At least one sequence of mountains matching the given information will exist."
		}
	]
}