{
	"link":"http://community.topcoder.com/stat?c=problem_statement&pm=996&rd=4372",
	"statement":"<p> A traveling salesman has recently decided to go international and sell his wares around the globe. He has done in depth research and has come up with a list of cities which he thinks will provide the best market for his goods. In planning his trip, the salesman wants to minimize the total distance he has to travel because he does not particularly like traveling (which is unfortunate for him, as he is a traveling salesman) and furthermore, he figures the less distance he has to travel, the cheaper his trip will be. However, this salesman is not particularily good at math, and so you must write a computer program to help him find his way in the least distance. </p><p> You will be given a set of cities defined by their longitudes and latitudes. In addition, you will be given the radius of the planet that this traveling salesman resides on. Assume that there are direct flights, both ways, between every pair of cities that the salesman wants to visit, and that the flights follow the shortest path possible (over the surface of the planet). In addition, the first element of the input String[] will be the city in which the salesman lives, and thus his trip must start and end at this city. </p><p> Each city is defined by two numbers, a latitude and a longitude. The latitude is the number of degrees above the equator, with 90 being the north pole, and -90 being the south pole. The longitude is the number of degrees east or west of some arbitrary, predefined point. Thus, 90 degrees east is one quarter of the way around the globe in the eastern direction. </p><p> If the result is not an integer, round it to the nearest integer (.5 rounds up) </p>",
	"notes":[
		{
			"order":1,
			"val":"Assume the planet is a perfect sphere."
		},
		{
			"order":2,
			"val":"To find the cartesion coordinates of a city, assuming the center of the planet is at (0,0,0), use the following formulas:x = r*cos(latitude)*cos(longitude)y = r*cos(latitude)*sin(longitude)z = r*sin(latitude)"
		}
	],
	"definition":[
		{
			"definitionKey":"Class:",
			"definitionVal":"Travel",
			"order":1
		},
		{
			"definitionKey":"Method:",
			"definitionVal":"shortest",
			"order":2
		},
		{
			"definitionKey":"Parameters:",
			"definitionVal":"String[], int",
			"order":3
		},
		{
			"definitionKey":"Returns:",
			"definitionVal":"int",
			"order":4
		},
		{
			"definitionKey":"Method signature:",
			"definitionVal":"int shortest(String[] cities, int radius)",
			"order":5
		}
	],
	"examples":[
		{
			"expect":"1000",
			"id":0,
			"input":"{\"0 0\",\"0 1\"}",
			"note":"The two cities are located one degree apart at the same latitude",
			"order":1
		},
		{
			"expect":"1",
			"id":0,
			"input":"{\"0 0\",\"0 1\",\"0 -1\",\"-1 0\",\"1 0\",\"-1 -1\",\"1 1\",\"1 -1\",\"-1 1\"}",
			"order":2
		},
		{
			"expect":"698",
			"id":0,
			"input":"{\"40 -82\",\"-27 -59\",\"-40 48\" ,\"26 -12\",\"-31 -37\",\"-30 42\" ,\"-36 -23\",\"-26 71\",\"-19 83\",\"8 63\"}",
			"order":3
		}
	],
	"constraints":[
		{
			"order":1,
			"val":"cities contains between 2 and 9 elements, inclusive."
		},
		{
			"order":2,
			"val":"Each element of cities represents a unique point on the globe."
		},
		{
			"order":3,
			"val":"Each element of cities is formatted as &quot;&lt;latitude&gt; &lt;longitude&gt;&quot; where &lt;latitude&gt; is an integer in the range -90 to 90, inclusive, and &lt;longitude&gt; is an integer in the range -180 to 180, inclusive."
		},
		{
			"order":4,
			"val":"radius is an integer between 1 and 1,000, inclusive."
		},
		{
			"order":5,
			"val":"to avoid rounding errors, the shortest path, prior to rounding, will not be within 0.001 of &lt;x&gt;+0.5 for any integer &lt;x&gt;."
		}
	]
}